import 'chat_page.dart';
import 'package:flutter/material.dart';
import 'package:url_launcher/url_launcher.dart';
import 'package:google_maps_flutter/google_maps_flutter.dart';
import 'package:geolocator/geolocator.dart';

void main() => runApp(SouthernLuxuryApp());

class SouthernLuxuryApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      debugShowCheckedModeBanner: false,
      theme: ThemeData(
        colorScheme: ColorScheme.fromSeed(
          seedColor: const Color.fromARGB(255, 19, 54, 21),
        ),
        fontFamily: 'Tajawal',
      ),
      home: HomePage(),
    );
  }
}

class HomePage extends StatefulWidget {
  @override
  _HomePageState createState() => _HomePageState();
}

class _HomePageState extends State<HomePage> {
  List<Map<String, dynamic>> favorites = [];
  final List<Map<String, dynamic>> regions = [
    {
      'name': 'عسير',
      'image': 'assets/images/abha.jpg',
      'desc': 'عروس الجنوب وسيدة الضباب',
      'provinces': [
        {
          'name': 'ابها',
          'places': [
            {
              'name': 'منتزه السودة السياحي',
              'type': 'أماكن سياحية',
              'loc': 'منتزه السودة السياحي',
              'desc':
                  'منتزه جبلي بارد يطل على تهامة ويتميز بغابات العرعر والضباب الكثيف.',
              'rating': 4.9,
            },
            {
              'name': 'مطل الشرقي ابها',
              'type': 'أماكن سياحية',
              'loc': 'مطل الشرقي ابها',
              'desc':
                  'مطل رائع يمنحك نظرة بانورامية على مدينة أبها وجمال جبالها.',
              'rating': 4.7,
            },
            {
              'name': 'مزرعة الليلوان',
              'type': 'أماكن سياحية',
              'loc': ' مزرعة الليوان ',
              'desc':
                  'مكان ريفي هادئ يجمع بين الطبيعة وتجربة الزراعة الجنوبية.',
              'rating': 4.6,
            },
            {
              'name': 'سد ابها',
              'type': 'أماكن سياحية',
              'loc': 'سد ابها',
              'desc':
                  'بحيرة السد الشهيرة حيث يمكنك الاستمتاع بالمشي والمناظر المائية الجذابة.',
              'rating': 4.5,
            },
            {
              'name': 'مدماك',
              'type': 'أماكن سياحية',
              'loc': 'شتاء مدماك ابها',
              'desc':
                  'موقع تاريخي يتميز بطراز معماري أصيل يحكي قصة عراقة الجنوب.',
              'rating': 4.4,
            },
            {
              'name': 'بيفاندا سد ضبوعي',
              'type': 'أماكن سياحية',
              'loc': 'بيفاندا سد ضبوعي',
              'desc':
                  'موقع هادئ قرب السد يوفر تجربة فريدة للاسترخاء في أحضان الطبيعة.',
              'rating': 4.5,
            },
            {
              'name': 'مطل السحاب',
              'type': 'أماكن سياحية',
              'loc': 'مطل السحاب ابها',
              'desc':
                  'أحد أعلى المطلات في المنطقة حيث تلامس الغيوم قمم الجبال بجمال باهر.',
              'rating': 5.0,
            },
            {
              'name': 'طبب التاريخية',
              'type': 'أماكن سياحية',
              'loc': 'طبب التاريخية ابها',
              'desc':
                  'قرية أثرية تضم مساجد وقصور قديمة تعبر عن تاريخ عسير العريق.',
              'rating': 4.8,
            },
            {
              'name': 'مزرعةالسحاب للفراولة',
              'type': 'أماكن سياحية',
              'loc': 'مزرعة السحاب للفراولة ابها',
              'desc': 'تجربة ممتعة لقطف الفراولة الطازجة في أجواء جبلية رائعة.',
              'rating': 4.7,
            },
            {
              'name': 'ابو خيال',
              'type': 'أماكن سياحية',
              'loc': 'حديقة ابو خيال ابها',
              'desc':
                  'حديقة أيقونية تطل على الجبل الأخضر، مثالية للعوائل وهواة التصوير.',
              'rating': 4.8,
            },
            {
              'name': 'شارع الفن',
              'type': 'أماكن سياحية',
              'loc': 'شارع الفن',
              'desc':
                  'قلب أبها الفني، حيث تلتقي المظلات الملونة بلوحات الفنانين والمقاهي المميزة.',
              'rating': 4.9,
            },
            {
              'name': 'المفتاحة',
              'type': 'أماكن سياحية',
              'loc': 'المفتاحية ابها',
              'desc':
                  'قرية تشكيلية تضم مسمر المفتاحة وتعتبر مركزاً للفن والتراث الجنوبي.',
              'rating': 4.7,
            },
            {
              'name': 'مجمع سكاي فيلج',
              'type': 'أماكن سياحية',
              'loc': 'مجمع سكاي فيلج ابها',
              'desc':
                  'مجمع ترفيهي وسياحي يجمع بين الإطلالات الخلابة والخدمات المتنوعة.',
              'rating': 4.6,
            },
            {
              'name': 'بني مازن',
              'type': 'أماكن سياحية',
              'loc': 'بني مازن ابها',
              'desc':
                  'قرية جبلية هادئة تتميز بالخضرة الدائمة ومدرجاتها الزراعية الجميلة.',
              'rating': 4.5,
            },
            {
              'name': 'واحة عسيب',
              'type': 'أماكن سياحية',
              'loc': 'واحة عسيب ابها',
              'desc':
                  'مكان هادئ وسط الطبيعة يوفر تجربة فريدة للاستمتاع بهدوء الجبال.',
              'rating': 4.4,
            },
            {
              'name': 'مزرعة اعناب',
              'type': 'أماكن سياحية',
              'loc': 'مزرعة اعناب ابها',
              'desc':
                  'مزرعة سياحية تتيح لك الاستمتاع بجني الأعناب والتعرف على طرق زراعتها.',
              'rating': 4.7,
            },
            {
              'name': 'مزرعة التوت الاسود ',
              'type': 'أماكن سياحية',
              'loc': 'مزرعة التوت الاسود ابها',
              'desc':
                  'مزرعة مختصة في التوت الأسود توفر أجواء ريفية جميلة للزوار.',
              'rating': 4.6,
            },
            {
              'name': 'قصور ابو نقطة',
              'type': 'معالم أثرية',
              'loc': 'قصور ابو نقطة ابها',
              'desc':
                  'قصور تاريخية شامخة في قرية طبب تمثل القوة والهندسة المعمارية القديمة.',
              'rating': 4.9,
            },
            {
              'name': 'قصور البو سراح',
              'type': 'معالم أثرية',
              'loc': 'قصور البو سراح ابها',
              'desc':
                  'تحفة معمارية تراثية تقع في قرية العزيزة وتعكس حياة الماضي بجمالها.',
              'rating': 4.8,
            },
            {
              'name': 'قرية توق التراثية',
              'type': 'معالم أثرية',
              'loc': 'قرية تةق التراثية ابها',
              'desc':
                  'قرية سياحية متكاملة تجمع بين المطاعم التراثية والمتاحف الصغيرة.',
              'rating': 4.7,
            },
            {
              'name': 'متحف لجووان التراثي',
              'type': 'معالم أثرية',
              'loc': 'متحف لجوووان التراثي ابها',
              'desc':
                  'متحف يحكي قصة التراث الجنوبي من خلال قطع أثرية نادرة ومقتنيات قديمة.',
              'rating': 4.8,
            },
            {
              'name': 'قرية رجال ألمع التراثية',
              'type': 'معالم أثرية',
              'loc': 'رجال ألمع',
              'desc':
                  'أيقونة التاريخ في عسير، تتميز بمبانيها الحجرية الملونة وتاريخها العريق.',
              'rating': 5.0,
            },
            {
              'name': 'بسطة القابل',
              'type': 'معالم أثرية',
              'loc': 'بسطة القابل ابها',
              'desc':
                  'سوق شعبي يفوح بعبق الماضي، يشتهر ببيع المنتجات التقليدية والحرف اليدوية.',
              'rating': 4.6,
            },
            {
              'name': 'قرية النصب',
              'type': 'معالم أثرية',
              'loc': 'قرية النصب ابها',
              'desc':
                  'حي تاريخي في قلب أبها يتميز بالعمارة العسيرية الأصيلة والنقوش التراثية.',
              'rating': 4.7,
            },
            {
              'name': 'مطعم سينسو',
              'type': 'مطاعم',
              'loc': 'مطعم سينسو ابها',
              'desc':
                  'مطعم راقي يقدم تجربة طعام إيطالية مميزة مع إطلالات جميلة على المدينة.',
              'rating': 4.5,
            },
            {
              'name': 'فلنت',
              'type': 'مقاهي',
              'loc': 'كوفي فلنت ابها',
              'desc':
                  'مقهى عصري يتميز بديكوراته الهادئة وجلساته المريحة، مثالي للعمل أو القراءة.',
              'rating': 4.8,
            },
            {
              'name': 'كيريو كافيه | Qiryo',
              'type': 'مقاهي',
              'loc': 'كوفي كيريو ابها',
              'desc':
                  'وجهة مميزة لعشاق القهوة المختصة، يجمع بين الجودة والأجواء الشبابية الرائعة.',
              'rating': 4.9,
            },
            {
              'name': 'DM كوفي دي ام',
              'type': 'مقاهي',
              'loc': 'كوفي دي ام ابها',
              'desc':
                  'مقهى متميز بتقديم أنواع مبتكرة من القهوة والحلويات في قلب مدينة أبها.',
              'rating': 4.7,
            },
            {
              'name': 'OUT OF LINE',
              'type': 'مقاهي',
              'loc': 'أبها',
              'desc':
                  'تصميم فريد وقائمة مشروبات متنوعة تجعل منه مكاناً مفضلاً للقاء الأصدقاء.',
              'rating': 4.6,
            },
            {
              'name': 'REAP كوفي ريب',
              'type': 'مقاهي',
              'loc': 'أبها',
              'desc':
                  'يتميز بجودة البن المحمص بعناية وأجواء هادئة تساعد على الاسترخاء.',
              'rating': 4.8,
            },
            {
              'name': 'DORM كوفي دورم',
              'type': 'مقاهي',
              'loc': 'أبها',
              'desc':
                  'مساحة عصرية تقدم تجربة قهوة استثنائية مع تركيز عالٍ على أدق التفاصيل.',
              'rating': 4.7,
            },
          ],
        },
        {
          'name': 'بيشة',
          'places': [
            {
              'name': 'سكاي ستار السياحي',
              'type': 'أماكن سياحية',
              'loc': 'سكاي ستار السياحي بيشة',
            },
            {
              'name': 'منتجع قلعة الحصن السياحي',
              'type': 'أماكن سياحية',
              'loc': 'منتجع قلعة الحصن السياحي بيشة',
            },
            {
              'name': 'منتجع خيال الطبيعة للترفيه',
              'type': 'أماكن سياحية',
              'loc': 'منتجع خيال الطبيعة للترفيه بيشه',
            },
            {
              'name': 'مزرعة الفي',
              'type': 'أماكن سياحية',
              'loc': 'مزرعة الفي بيشه',
            },
            {
              'name': 'منتجع بن شوكان الترفيهي',
              'type': 'أماكن سياحية',
              'loc': 'منتجع بن شوكان الترفيهي بيشة',
            },
            {
              'name': 'متحف ام فايز للتراث',
              'type': 'معالم أثرية',
              'loc': 'متحف ام فايز للتراث بيشة',
            },
            {
              'name': 'وايت وولف WHITE WOLF',
              'type': 'مقاهي',
              'loc': 'وايت وولف WHITE WOLF بيشة',
            },
            {
              'name': 'كوماس كوفي Commas Coffee',
              'type': 'مقاهي',
              'loc': 'كوماس كوفي Commas Coffee بيشة',
            },
            {'name': 'La vie cafe', 'type': 'مقاهي', 'loc': 'La vie cafe بيشة'},
            {
              'name': 'Particles Bakery and coffee',
              'type': 'مقاهي',
              'loc': 'Particles Bakery and coffee بيشة',
            },
            {'name': 'رشفة سوداء', 'type': 'مقاهي', 'loc': ' رشفة سوداء بيشة'},
            {'name': 'مقهى بريسكو', 'type': 'مقاهي', 'loc': 'مقهى بريسكو بيشة'},
            {
              'name': 'كوفي ثمن جرام',
              'type': 'مقاهي',
              'loc': ' كوفي ثمن جرام بيشة',
            },
            {'name': 'مقهى بيتشر', 'type': 'مقاهي', 'loc': ' مقهى بيتشر بيشة'},
            {'name': 'لامير كافيه', 'type': 'مقاهي', 'loc': 'لامير كافيه بيشة'},
            {
              'name': 'مقهى زاه - ZAH',
              'type': 'مقاهي',
              'loc': ' مقهى زاه - ZAH بيشة',
            },
            {'name': 'كوفي نثر', 'type': 'مقاهي', 'loc': 'كوفي نثر بيشة'},
          ],
        },
        {
          'name': 'احد رفيدة',
          'places': [
            {
              'name': 'كافي تاور',
              'type': 'مقاهي',
              'loc': 'كافي تاور احد رفيده',
            },
            {'name': 'دكة هوى', 'type': 'مقاهي', 'loc': 'دكة هوى احد رفيده'},
            {'name': 'كفه بلس', 'type': 'مقاهي', 'loc': 'كفه بلس احد رفيده'},
            {
              'name': 'جبل القصص',
              'type': 'مقاهي',
              'loc': 'جبل القصص احد رفيده',
            },
            {
              'name': 'مقهى الالماس الاسود',
              'type': 'مقاهي',
              'loc': 'مقهى الالماس الاسود احد رفيده',
            },
            {
              'name': 'كوفي كُباية',
              'type': 'مقاهي',
              'loc': 'كوفي كُباية احد رفيده',
            },
            {
              'name': 'موشا كافيه',
              'type': 'مقاهي',
              'loc': 'موشا كافيه احد رفيده',
            },
            {'name': 'شفقه', 'type': 'مقاهى', 'loc': 'شفقه احد رفيده'},
            {
              'name': 'كيان كافيه',
              'type': 'مقاهي',
              'loc': 'كيان كافيه احد رفيده',
            },
            {
              'name': 'مقهى OKللقهوة المختصة',
              'type': 'مقاهي',
              'loc': 'مقهى OKللقهوة المختصة احد رفيده',
            },
            {
              'name': 'عنوان القهوة',
              'type': 'مقاهي',
              'loc': ' عنوان القهوة احد رفيده',
            },
            {
              'name': 'مقهى مجلس ترف',
              'type': 'مقاهي',
              'loc': ' مقهى مجلس ترف احد رفيده',
            },
            {
              'name': 'كيان كافيه',
              'type': 'مقاهي',
              'loc': 'كيان كافيه احد رفيده',
            },
          ],
        },
        {
          'name': 'سبت العلايا',
          'places': [],
        },
        {
          'name': 'سراة عبيدة',
          'places': [],
        },
        {
          'name': 'ظهران الجنوب',
          'places': [],
        },
        {
          'name': 'النماص',
          'places': [
            {
              'name': 'قصور العسابلة',
              'type': 'أماكن سياحية',
              'loc': 'قصور العسابلة النماص',
            },
            {
              'name': 'منتزه غيل',
              'type': 'أماكن سياحية',
              'loc': 'منتزه غيل النماص',
            },
            {
              'name': 'جبل ناصر',
              'type': 'أماكن سياحية',
              'loc': 'جبل ناصر النماص',
            },
            {
              'name': 'منتجع ليكو السياحي',
              'type': 'أماكن سياحية',
              'loc': 'منتجع ليكو السياحي النماص',
            },
            {
              'name': 'ممشى الضباب',
              'type': 'أماكن سياحية',
              'loc': 'ممشى الضباب النماص',
            },
            {
              'name': 'قصر المقر ',
              'type': 'معالم أثرية',
              'loc': 'قصر المقر النماص',
            },
            {
              'name': ' متحف النماص التراثي',
              'type': 'معالم أثرية',
              'loc': 'متحف النماص التراثي',
            },
            {
              'name': 'متحف بن سلام التراثي بقرية الميفا',
              'type': 'معالم أثرية',
              'loc': 'متحف بن سلام التراثي بقرية الميفاالنماص',
            },
            {
              'name': 'قرية ال جبر',
              'type': 'معالم أثرية',
              'loc': 'قرية ال جبر النماص',
            },
            {
              'name': 'قرية النييح التاريخية|بني بكر',
              'type': 'معالم أثرية',
              'loc': 'قرية النييح التاريخية النماص',
            },
            {
              'name': 'قرية الجهوة التراثية| بني بكر',
              'type': 'معالم أثرية',
              'loc': 'قرية الجهوة التراثية| بني بكر النماص',
            },
            {
              'name': 'مجمع ومتحف اليحيى الصناعي',
              'type': 'معالم أثرية',
              'loc': 'مجمع ومتحف اليحيى الصناعي النماص',
            },
            {
              'name': 'مجمع تراثية التجاري',
              'type': 'معالم أثرية',
              'loc': 'مجمع تراثية التجاري النماص',
            },
            {
              'name': 'قصر ثربان',
              'type': 'معالم أثرية',
              'loc': 'قصر ثربان النماص',
            },
            {
              'name': 'قرية صدريد التراثية',
              'type': 'معالم أثرية',
              'loc': 'قرية صدريد التراثية النماص',
            },
            {
              'name': 'متحف ابن صوفان',
              'type': 'معالم أثرية',
              'loc': 'متحف ابن صوفان النماص',
            },
            {
              'name': 'مجمع احمد بن خلوفة التراثي',
              'type': 'معالم أثرية',
              'loc': 'مجمع احمد بن خلوفة التراثي النماص',
            },
            {
              'name': 'متحف غرمان بن يحيى التراثي',
              'type': 'معالم أثرية',
              'loc': 'متحف غرمان بن يحيى التراثي النماص',
            },
            {'name': 'كوفي شفقة', 'type': 'مقاهي', 'loc': 'شقفه النماص'},
            {'name': 'كترة كوفي', 'type': 'مقاهي', 'loc': 'كترة النماص'},
            {
              'name': 'فورتين قهوة مختصة',
              'type': 'مقاهي',
              'loc': 'فورتين كوفي النماص',
              'rating': 4.6,
            },
            {
              'name': 'ديلي كب',
              'type': 'مقاهي',
              'loc': 'كوفي ديلي كب النماص',
              'rating': 4.6,
            },
            {
              'name': 'تويلف',
              'type': 'مقاهي',
              'loc': 'تويلف النماص',
              'rating': 4.6,
            },
            {
              'name': 'كاكتوس',
              'type': 'مقاهي',
              'loc': 'كوفي كاكتوس النماص',
              'rating': 4.6,
            },
            {
              'name': 'روايا كافي',
              'type': 'مقاهي',
              'loc': 'روايا النماص',
              'rating': 4.6,
            },
            {
              'name': 'دوباكاف',
              'type': 'مقاهي',
              'loc': 'كوفي دوباكاف النماص',
              'rating': 4.6,
            },
            {
              'name': 'رفاه قهوة مختصة',
              'type': 'مقاهي',
              'loc': 'كوفي رفاه النماص',
              'rating': 4.6,
            },
            {
              'name': 'مقهى كلاود فيو',
              'type': 'مقاهي',
              'loc': 'مقهى كلاود فيو النماص',
              'rating': 4.6,
            },
            {
              'name': 'BN ROSE',
              'type': 'مقاهي',
              'loc': 'BN ROSE النماص',
              'rating': 4.6,
            },
            {
              'name': 'مقهى نيف',
              'type': 'مقاهي',
              'loc': 'مقهى نيف النماص',
              'rating': 4.6,
            },
            {
              'name': 'مودي كافيه',
              'type': 'مقاهي',
              'loc': 'مودي كافيه النماص',
              'rating': 4.6,
            },
            {
              'name': 'محمصة ومقهى قطرات ذهبيه',
              'type': 'مقاهي',
              'loc': 'محمصة ومقهى قطرات ذهبيه النماص',
              'rating': 4.6,
            },
            {
              'name': 'N5كوفي ',
              'type': 'مقاهي',
              'loc': 'N5 النماص',
              'rating': 4.6,
            },
            {
              'name': 'رش كافيه',
              'type': 'مقاهي',
              'loc': ' رش كافيه النماص',
              'rating': 4.6,
            },
            {
              'name': 'مقهى نيف',
              'type': 'مقاهي',
              'loc': 'مقهى نيف النماص',
              'rating': 4.6,
            },
            {
              'name': 'تشيري',
              'type': 'مقاهي',
              'loc': 'تشيري النماص',
              'rating': 4.6,
            },
            {
              'name': 'مبدى',
              'type': 'مقاهي',
              'loc': 'مبدى النماص',
              'rating': 4.6,
            },
            {
              'name': 'صوبي',
              'type': 'مقاهي',
              'loc': 'صوبي النماص',
              'rating': 4.6,
            },
            {
              'name': 'كانون القرية',
              'type': 'مطاعم',
              'loc': 'مطعم كانون القريةالنماص',
            },
            {'name': 'مطعم كبدة زد', 'type': 'مطاعم', 'loc': 'كبدة زد النماص'},
            {
              'name': 'مطعم بابا عنتر',
              'type': 'مطاعم',
              'loc': 'بابا عنتر النماص',
            },
            {
              'name': 'مطعم كلاندر',
              'type': 'مطاعم',
              'loc': 'مطعم كلاندر النماص',
            },
            {
              'name': 'مأكولات بحرية',
              'type': 'مطاعم',
              'loc': 'مأكولات بحرية النماص',
            },
            {
              'name': 'مطعم قرية الجهوة',
              'type': 'مطاعم',
              'loc': 'مطعم قرية الجهوة النماص',
            },
            {'name': 'مطعم بيفو', 'type': 'مطاعم', 'loc': 'بيفو النماص'},
            {
              'name': 'بيت اللذائذ',
              'type': 'مطاعم',
              'loc': 'بيت اللذائذ النماص',
            },
            {
              'name': 'مطعم زهرة الجنوب',
              'type': 'مطاعم',
              'loc': 'مطعم زهرة الجنوب النماص',
            },
            {
              'name': 'مطعم السرايا',
              'type': 'مطاعم',
              'loc': 'مطعم السرايا النماص',
            },
            {
              'name': 'مطعم بيت العمدة',
              'type': 'مطاعم',
              'loc': 'مطعم بيت العمدة النماص',
            },
            {
              'name': 'مطعم لهيب الجمر',
              'type': 'مطاعم',
              'loc': 'مطعم لهيب الجمر النماص',
            },
            {
              'name': 'امبراطور المشاوي',
              'type': 'مطاعم',
              'loc': 'امبراطور المشاوي النماص',
            },
            {
              'name': 'مطاعم مكبوس سنان',
              'type': 'مطاعم',
              'loc': 'مطاعم مكبوس سنان النماص',
            },
            {
              'name': 'اصل البرجر',
              'type': 'مطاعم',
              'loc': 'مطعم اصل البرجر النماص',
            },
          ],
        },
        {
          'name': 'بللسمر',
          'places': [
            {
              'name': 'منتزه تمنية الوطني',
              'type': 'أماكن سياحية',
              'loc': 'بللسمر',
              'rating': 4.8,
            },
            {
              'name': 'سد بللسمر التاريخي',
              'type': 'معالم أثرية',
              'loc': 'وادي بللسمر',
              'rating': 4.3,
            },
            {
              'name': 'مطعم ريف الجنوب',
              'type': 'مطاعم',
              'loc': 'بللسمر - المركز',
              'rating': 4.5,
            },
            {
              'name': 'مطل الجبال السبعة',
              'type': 'أماكن سياحية',
              'loc': 'شمال بللسمر',
              'rating': 4.9,
            },
            {
              'name': 'قرية سدوان التاريخية',
              'type': 'معالم أثرية',
              'loc': 'بللسمر',
              'rating': 4.6,
            },
            {
              'name': 'منتزه وكوفي فيه',
              'type': 'أماكن سياحية',
              'loc': 'بللسمر منتزه وكوفي فيه',
              'rating': 4.6,
            },
            {
              'name': 'كوفي هاون',
              'type': 'مقاهي',
              'loc': 'كوفي هاون بللسمر',
              'rating': 4.6,
            },
            {
              'name': 'جميلة كافيه',
              'type': 'مقاهي',
              'loc': 'بللسمر جميلة كافيه',
              'rating': 4.6,
            },
            {
              'name': 'كافي ريلاكس بوكس',
              'type': 'مقاهي',
              'loc': 'كافي ريلاكس بوكس',
              'rating': 4.6,
            },
            {
              'name': 'وادي عيا',
              'type': 'أماكن سياحية',
              'loc': 'وادي عيا بللسمر',
              'rating': 4.6,
            },
            {
              'name': '55كوفي',
              'type': 'مقاهي',
              'loc': '55كوفي بللسمر',
              'rating': 4.6,
            },
            {
              'name': 'مطعم البيت العربي',
              'type': 'مطاعم',
              'loc': 'مطعم البيت العربي بللسمر',
              'rating': 4.6,
            },
            {
              'name': 'مطبخ الخير',
              'type': 'مطاعم',
              'loc': 'مطبخ الخير بللسمر',
              'rating': 4.6,
            },
            {
              'name': 'مطعم نكهات',
              'type': 'مطاعم',
              'loc': 'مطعم نكهات بللسمر',
              'rating': 4.6,
            },
            {
              'name': 'منتزه خلقة',
              'type': 'أماكن سياحية',
              'loc': 'منتزه خلقة بللسمر',
              'rating': 4.6,
            },
          ],
        },
        {
          'name': 'تنومة',
          'places': [
            {
              'name': 'سارية',
              'type': 'مقاهي',
              'loc': 'سارية سارية تنومه',
              'rating': 4.6,
            },
            {
              'name': 'اغسطس كوفي',
              'type': 'مقاهي',
              'loc': 'اغسطس كوفي تنومه',
              'rating': 4.6,
            },
            {
              'name': 'امبريلا كافيه',
              'type': 'مقاهي',
              'loc': 'امبريلا كافيه تنومه',
              'rating': 4.6,
            },
            {
              'name': 'هاون كافيه',
              'type': 'مقاهي',
              'loc': 'هاون كافيه تنومه',
              'rating': 4.6,
            },
            {
              'name': 'دانتلا كافيه',
              'type': 'مقاهي',
              'loc': 'دانتلا كافيه تنومه',
              'rating': 4.6,
            },
            {
              'name': 'تويلف|قهوة مختصة',
              'type': 'مقاهي',
              'loc': 'تويلف تنومه',
              'rating': 4.6,
            },
            {
              'name': 'كوفي بلا ميعاد',
              'type': 'مقاهي',
              'loc': 'كوفي بلا ميعاد تنومه',
              'rating': 4.6,
            },
            {
              'name': 'جافا ستور',
              'type': 'مقاهي',
              'loc': 'جافا ستور تنومه',
              'rating': 4.6,
            },
            {
              'name': 'كوفي هيفان',
              'type': 'مقاهي',
              'loc': 'كوفي هيفان تنومه',
              'rating': 4.6,
            },
            {
              'name': 'مقهى سكة',
              'type': 'مقاهي',
              'loc': 'مقهى سكة تنومه',
              'rating': 4.6,
            },
            {
              'name': 'منتجع واجهة تنومة السياحي',
              'type': 'أماكن سياحية',
              'loc': 'منتجع واجهة تنومة السياحي',
              'rating': 4.7,
            },
            {
              'name': 'وادي تنومة',
              'type': 'أماكن سياحية',
              'loc': 'وادي تنومة',
              'rating': 4.7,
            },
            {
              'name': 'حديقة شلال تنومة',
              'type': 'أماكن سياحية',
              'loc': 'حديقة شلال تنومة',
              'rating': 4.7,
            },
            {
              'name': 'منتزه الشرف',
              'type': 'أماكن سياحية',
              'loc': 'منتزه الشرف تنومة',
              'rating': 4.7,
            },
            {
              'name': 'منتزه الاربوعة',
              'type': 'أماكن سياحية',
              'loc': ' منتزه الاربوعة تنومة',
              'rating': 4.7,
            },
            {
              'name': 'حديقة شلال تنومة',
              'type': 'أماكن سياحية',
              'loc': 'حديقة شلال تنومة',
              'rating': 4.7,
            },
            {
              'name': 'حصن ال عون',
              'type': 'معالم أثرية',
              'loc': 'حصن ال عون تنومه',
            },
            {
              'name': 'القرية التراثية ',
              'type': 'معالم أثرية',
              'loc': ' القرية التراثية تنومه',
            },
            {
              'name': 'القرية التراثية بالقريه',
              'type': 'معالم أثرية',
              'loc': 'القريه التراثية بالقرية',
            },
            {
              'name': 'حصن ال عون',
              'type': 'معالم أثرية',
              'loc': 'حصن ال عون تنومه',
            },
          ]
        },
        {
          'name': 'خميس مشيط',
          'places': [
            {
              'name': 'متحف موروث الاجداد',
              'type': 'معالم أثرية',
              'loc': 'متحف موروث الاجداد',
            },
            {
              'name': 'قرية بن حمسان',
              'type': 'معالم أثرية',
              'loc': 'قرية بن حمسان',
            },
            {
              'name': 'متحف العامرية',
              'type': 'معالم أثرية',
              'loc': 'متحف العامرية خميس مشيط',
            },
            {
              'name': 'متحف خميس مشيط',
              'type': 'معالم أثرية',
              'loc': 'متحف خميس مشيط',
            },
            {
              'name': 'قرية الصالحية التراثية',
              'type': 'معالم أثرية',
              'loc': 'قرية الصالحية التراثية خميس مشيط',
            },
            {
              'name': 'قصر مالك التاريخي',
              'type': 'معالم أثرية',
              'loc': 'قصر مالك التاريخي خميس مشيط',
            },
            {
              'name': 'متحف ماضينا الجميل',
              'type': 'معالم أثرية',
              'loc': 'متحف ماضينا الجميل خميس مشيط',
            },
            {
              'name': 'قصر ال مشيط التاريخي',
              'type': 'معالم أثرية',
              'loc': 'قصر ال مشيط التاريخي خميس مشيط',
            },
            {
              'name': 'موقع جرش الاثري',
              'type': 'معالم أثرية',
              'loc': 'موقع جرش الاثري ',
            },
            {
              'name': 'مهرجان خميس مشيط',
              'type': 'أماكن سياحية',
              'loc': 'مهرجان خميس مشيط',
            },
            {
              'name': 'حديقة الامير سلطان ',
              'type': 'أماكن سياحية',
              'loc': 'حديقة الامير سلطان خميس مشيط',
            },
            {
              'name': 'حديقة الرصراص للعائلات',
              'type': 'أماكن سياحية',
              'loc': 'حديقة الرصراص خميس مشيط',
            },
            {
              'name': 'ممشى الراقي',
              'type': 'أماكن سياحية',
              'loc': 'ممشى الراقي خميس مشيط',
            },
            {
              'name': 'حديقة الروضة ',
              'type': 'أماكن سياحية',
              'loc': 'حديقة الروضة خميس مشيط',
            },
            {
              'name': 'حديقة الدرب العامة',
              'type': 'أماكن سياحية',
              'loc': 'حديقة الدرب العامة خميس مشيط',
            },
            {
              'name': 'حديقة البلدية',
              'type': 'أماكن سياحية',
              'loc': 'حديقة البلدية خميس مشيط',
            },
            {
              'name': 'البلد',
              'type': 'أماكن سياحية',
              'loc': 'البلد خميس مشيط',
            },
            {
              'name': 'ممشى خميس الرياض',
              'type': 'أماكن سياحية',
              'loc': 'ممشى خميس الرياض',
            },
            {
              'name': 'موجان بارك',
              'type': 'أماكن سياحية',
              'loc': 'موجان بارك خميس مشيط',
            },
            {
              'name': 'بيلوفيدار',
              'type': 'أماكن سياحية',
              'loc': 'بيلوفيدار خميس مشيط',
            },
            {
              'name': 'الغنيم سكوير',
              'type': 'أماكن سياحية',
              'loc': 'الغنيم سكوير خميس مشيط',
            },
            {
              'name': 'البوليفارد',
              'type': 'أماكن سياحية',
              'loc': 'البوليفارد خميس مشيط',
            },
            {
              'name': 'الواحة سنتر ',
              'type': 'أماكن سياحية',
              'loc': 'الواحة سنتر خميس مشيط',
            },
            {
              'name': 'رفالا بلازا',
              'type': 'أماكن سياحية',
              'loc': 'رفالا بلازا خميس مشيط',
            },
            {
              'name': 'اصداف مول',
              'type': 'أماكن سياحية',
              'loc': 'اصداف مول خميس مشيط',
            },
            {
              'name': 'كاتويا كافيه',
              'type': 'مقاهي',
              'loc': 'كاتويا كافيه خميس مشيط',
            },
            {
              'name': 'نمق كافيه',
              'type': 'مقاهي',
              'loc': 'نمق كافيه خميس مشيط',
            },
            {
              'name': 'كوخ القمة',
              'type': 'مقاهي',
              'loc': 'كوخ القمة خميس مشيط',
            },
            {
              'name': 'كالت',
              'type': 'مقاهي',
              'loc': 'كالت خميس مشيط',
            },
            {
              'name': 'لوكيشن كافيه ',
              'type': 'مقاهي',
              'loc': 'لوكيشن كافيه خميس مشيط',
            },
            {
              'name': 'MONOGRAM CAFE',
              'type': 'مقاهي',
              'loc': 'MONOGRAM CAFEخميس مشيط',
            },
            {
              'name': 'ايت اوز كوفي',
              'type': 'مقاهي',
              'loc': 'خميس مشيط ايت اوز كوفي',
            },
            {
              'name': 'كافية باب السقيفه',
              'type': 'مقاهي',
              'loc': 'خميس مشيط كافيه باب السقيفه',
            },
            {
              'name': 'محمصة ومقهى بلاك سب',
              'type': 'مقاهي',
              'loc': 'خميس مشيط محمصة ومقهى بلاك سب',
            },
            {
              'name': 'ملعقة',
              'type': 'مقاهي',
              'loc': 'خميس مشيط ملعقة',
            },
            {
              'name': 'محمصة ومقهى لافوس',
              'type': 'مقاهي',
              'loc': 'خميس مشيط محمصة ومقهى لافوس',
            },
            {
              'name': 'اوفردوز',
              'type': 'مقاهي',
              'loc': 'خميس مشيط اوفردوز',
            },
            {
              'name': 'هافن كافيه',
              'type': 'مقاهي',
              'loc': 'خميس مشيط هافن كافيه',
            },
            {
              'name': 'ذا كلاوت كافيه',
              'type': 'مقاهي',
              'loc': 'خميس مشيط ذا كلاوت كافيه',
            },
            {
              'name': 'انجلي كافيه',
              'type': 'مقاهي',
              'loc': 'خميس مشيط انجلي كافيه',
            },
            {
              'name': 'ملء',
              'type': 'مقاهي',
              'loc': 'خميس مشيط ملء كافيه',
            },
            {
              'name': 'مطعم سندر',
              'type': 'مطاعم',
              'loc': 'مطعم سندر خميس مشيط',
            },
            {
              'name': 'مطعم ذوق الخميس',
              'type': 'مطاعم',
              'loc': 'مطعم ذوق الخميس خميس مشيط',
            },
            {
              'name': 'مطعم الماسية',
              'type': 'مطاعم',
              'loc': 'مطعم الماسية خميس مشيط',
            },
            {
              'name': 'مطعم مشراق',
              'type': 'مطاعم',
              'loc': 'مطعم مشراق خميس مشيط',
            },
            {
              'name': 'البيت التركي',
              'type': 'مطاعم',
              'loc': 'البيت التركي خميس مشيط',
            },
            {
              'name': 'مطاعم و محانذ الهناء',
              'type': 'مطاعم',
              'loc': 'مطاعم ومحانذ الهناء خميس مشيط',
            },
            {
              'name': 'فرن الضيعة',
              'type': 'مطاعم',
              'loc': 'فرن الضيعة خميس مشيط',
            },
            {
              'name': 'مطعم الكركند للمأكولات البحرية',
              'type': 'مطاعم',
              'loc': 'مطعم الكركند للمأكولات البحرية خميس مشيط',
            },
            {
              'name': 'مطعم ليالي الهند',
              'type': 'مطاعم',
              'loc': 'مطعم ليالي الهند خميس مشيط',
            },
            {
              'name': 'سلسلة مطاعم السدة',
              'type': 'مطاعم',
              'loc': 'سلسلة مطاعم السدة خميس مشيط',
            },
            {
              'name': 'مطعم نحت',
              'type': 'مطاعم',
              'loc': 'مطعم نحت خميس مشيط',
            },
            {
              'name': 'مطعم تولاي',
              'type': 'مطاعم',
              'loc': 'مطعم تولاي خميس مشيط',
            },
            {
              'name': 'مطعم مهراني',
              'type': 'مطاعم',
              'loc': 'مطعم مهراني خميس مشيط',
            },
            {
              'name': 'مطعم ثري بوينتس',
              'type': 'مطاعم',
              'loc': 'مطعم ثري بوينتس خميس مشيط',
            },
            {
              'name': 'مطعم البيت الرومانسي',
              'type': 'مطاعم',
              'loc': 'مطعم البيت الرومانسي خميس مشيط',
            },
            {
              'name': 'مطعم البيت العربي',
              'type': 'مطاعم',
              'loc': 'مطعم البيت العربي خميس مشيط',
            },
            {
              'name': 'مطعم دوما بالاس',
              'type': 'مطاعم',
              'loc': 'مطعم دوما بالاس خميس مشيط',
            },
            {
              'name': 'الحوت الماسي للمأكولات البحرية',
              'type': 'مطاعم',
              'loc': 'الحوت الماسي للماكولات البحريه خميس مشيط',
            },
            {
              'name': 'مطعم مشوي اوبشن',
              'type': 'مطاعم',
              'loc': 'مطعم مشوي اوبشن خميس مشيط',
            },
            {
              'name': 'مطعم هماس',
              'type': 'مطاعم',
              'loc': 'مطعم هماس خميس مشيط',
            },
            {
              'name': 'مطاعم الباشا',
              'type': 'مطاعم',
              'loc': 'مطاعم الباشا خميس مشيط',
            },
            {
              'name': 'مطاعم قصر الحاتمي',
              'type': 'مطاعم',
              'loc': 'مطاعم قصر الحاتمي',
            },
            {
              'name': 'مطعم تاج النخلة',
              'type': 'مطاعم',
              'loc': 'مطعم تاج النخلة خميس مشيط',
            },
            {
              'name': 'مطعم كوت مي',
              'type': 'مطاعم',
              'loc': 'مطعم كوت مي خميس مشيط',
            },
            {
              'name': 'كريفينج كلوب',
              'type': 'مطاعم',
              'loc': 'كريفينج كلوب خميس مشيط',
            },
            {
              'name': 'مطاعم ومطابخ المسقف',
              'type': 'مطاعم',
              'loc': 'مطاعم ومطابخ المسقف خميس مشيط',
            },
          ]
        },
        {
          'name': 'رجال المع',
          'places': [
            {
              'name': 'مندي جزيرة رجال المع',
              'type': 'مطاعم',
              'loc': 'مندي جزيرة رجال المع',
            },
            {
              'name': 'مطاعم ومحانذ بصمه رجال المع',
              'type': 'مطاعم',
              'loc': 'مطاعم ومحانذ بصمه رجال المع',
            },
            {
              'name': 'مطعم ومندي تمو رجال المع',
              'type': 'مطاعم',
              'loc': 'مطعم ومندي تمو رجال المع',
            },
            {
              'name': 'مطبخ رجال المع',
              'type': 'مطاعم',
              'loc': 'مطبخ رجال المع',
            },
            {
              'name': 'مطبخ ومندي حراء',
              'type': 'مطاعم',
              'loc': 'مطبخ ومندي حراء رجال المع',
            },
            {
              'name': 'مطعم اصداف للاسماك',
              'type': 'مطاعم',
              'loc': 'مطعم اصداف للاسماك رجال المع',
            },
            {
              'name': 'مطابخ ومحانذ البداية رجال المع',
              'type': 'مطاعم',
              'loc': 'مطابخ ومحانذ البداية رجال المع',
            },
            {
              'name': 'مطعم اسرار الكبسة',
              'type': 'مطاعم',
              'loc': 'مطعم اسرار الكبسة',
            },
            {
              'name': 'لهاليب تشكن رجال المع ',
              'type': 'مطاعم',
              'loc': 'لهاليب تشكن رجال المع',
            },
            {
              'name': 'ذوق المع',
              'type': 'مطاعم',
              'loc': 'ذوق المع رجال المع',
            },
            {
              'name': 'مطعم ضفة الوادي',
              'type': 'مطاعم',
              'loc': 'مطعم ضفة الوادي رجال المع',
            },
            {
              'name': 'مطعم اضواء الجبل',
              'type': 'مطاعم',
              'loc': 'مطعم اضواء الجبل رجال المع',
            },
            {
              'name': 'الدكة الريفيه',
              'type': 'مقاهي',
              'loc': 'الدكة الريفيه رجال المع',
            },
            {
              'name': 'القهوة الصخرية',
              'type': 'مقاهي',
              'loc': 'القهوة الصخرية رجال المع',
            },
            {
              'name': 'بلو',
              'type': 'مقاهي',
              'loc': 'بلو رجال المع',
            },
            {
              'name': 'ساخن وبارد',
              'type': 'مقاهي',
              'loc': 'ساخن وبارد رجال المع',
            },
            {
              'name': 'نسمة مكان',
              'type': 'مقاهي',
              'loc': 'نسمة مكان رجال المع',
            },
            {
              'name': 'الرشفة الاولى',
              'type': 'مقاهي',
              'loc': 'الرشفة الاولى رجال المع',
            },
            {
              'name': 'عنوان الروقان',
              'type': 'مقاهي',
              'loc': 'عنوان الروقان رجال المع',
            },
            {
              'name': 'ريكسا كافية',
              'type': 'مقاهي',
              'loc': 'ريكسا كافية رجال المع',
            },
            {
              'name': 'كوفي رومنس',
              'type': 'مقاهي',
              'loc': 'كوفي رومنس رجال المع',
            },
            {
              'name': 'دانكن دونتس ',
              'type': 'مقاهي',
              'loc': 'دانكن دونتس رجال المع',
            },
            {
              'name': '',
              'type': 'أماكن سياحية',
              'loc': '',
            },
            {
              'name': '',
              'type': 'أماكن سياحية',
              'loc': '',
            },
            {
              'name': '',
              'type': 'أماكن سياحية',
              'loc': '',
            },
            {
              'name': '',
              'type': 'أماكن سياحية',
              'loc': '',
            },
            {
              'name': '',
              'type': 'أماكن سياحية',
              'loc': '',
            },
            {
              'name': '',
              'type': 'أماكن سياحية',
              'loc': '',
            },
            {
              'name': '',
              'type': 'أماكن سياحية',
              'loc': '',
            },
          ]
        },
        {'name': 'محايل عسير', 'places': [


          ]
},
      ],
    },
    {
      'name': 'نجران',
      'image': 'assets/images/najran.jpg',
      'desc': 'مدينة الأخدود والنخيل',
      'provinces': [
        {
          'name': 'نجران',
          'places': [
            {
              'name': 'آثار الأخدود التاريخية',
              'type': 'معالم أثرية',
              'loc': 'الاخدود نجران',
            },
            {
              'name': 'غابة سقام - منتزه الملك فهد',
              'type': 'أماكن سياحية',
              'loc': 'غابة سقام نجران',
            },
            {
              'name': 'مطعم مكان الهندي',
              'type': 'مطاعم',
              'loc': 'مطعم مكان نجران',
            },
            {
              'name': 'بارن كافيه نجران',
              'type': 'مقاهي',
              'loc': 'Barn Cafe Najran',
            },
          ],
        },
        {
          'name': 'حبونا',
          'places': [],
        },
        {
          'name': 'شرورة',
          'places': [],
        },
      ],
    },
    {
      'name': 'الباحة',
      'image': 'assets/images/albaha.jpg',
      'desc': 'لؤلؤة الجبال وغابات العرعر',
      'provinces': [
        {
          'name': 'الباحة',
          'places': [
            {
              'name': 'قرية ذي عين التراثية',
              'type': 'معالم أثرية',
              'loc': 'ذي عين الباحة',
            },
            {
              'name': 'غابة رغدان السياحية',
              'type': 'أماكن سياحية',
              'loc': 'غابة رغدان الباحة',
            },
            {
              'name': 'مطعم ومخبز الجنوب',
              'type': 'مطاعم',
              'loc': 'مطعم الجنوب الباحة',
            },
            // --- كوفيهات الباحة ---
            {
              'name': 'Dose Cafe — الباحة',
              'type': 'مقاهي',
              'loc': 'Dose Cafe — الباحة',
            },
            {
              'name': 'Half Million Cafe — الباحة',
              'type': 'مقاهي',
              'loc': 'Half Million Cafe — الباحة',
            },
            {
              'name': 'Barn’s Cafe — الباحة',
              'type': 'مقاهي',
              'loc': 'Barn’s Cafe — الباحة',
            },
            {
              'name': 'Dr.Cafe — الباحة',
              'type': 'مقاهي',
              'loc': 'Dr.Cafe — الباحة',
            },
            {
              'name': 'Kiffa Roasters — الباحة',
              'type': 'مقاهي',
              'loc': 'Kiffa Roasters — الباحة',
            },
            {
              'name': 'Urban Cafe — الباحة',
              'type': 'مقاهي',
              'loc': 'Urban Cafe — الباحة',
            },
            {
              'name': 'Chapter Cafe — الباحة',
              'type': 'مقاهي',
              'loc': 'Chapter Cafe — الباحة',
            },
            {
              'name': 'Mug Cafe — الباحة',
              'type': 'مقاهي',
              'loc': 'Mug Cafe — الباحة',
            },
            {
              'name': 'Coffee Time — الباحة',
              'type': 'مقاهي',
              'loc': 'Coffee Time — الباحة',
            },
            {
              'name': 'Cafe Bateel — الباحة',
              'type': 'مقاهي',
              'loc': 'Cafe Bateel — الباحة',
            },
            {
              'name': 'Route Cafe — بلجرشي',
              'type': 'مقاهي',
              'loc': 'Route Cafe — بلجرشي',
            },
            {
              'name': 'Whiff Coffee — بلجرشي',
              'type': 'مقاهي',
              'loc': 'Whiff Coffee — بلجرشي',
            },
            {
              'name': 'Peak Cafe — المندق',
              'type': 'مقاهي',
              'loc': 'Peak Cafe — المندق',
            },
            {
              'name': 'V60 Cafe — المندق',
              'type': 'مقاهي',
              'loc': 'V60 Cafe — المندق',
            },

            // --- حدائق الباحة (سياحة) ---
            {
              'name': 'غابة رغدان — الباحة',
              'type': 'أماكن سياحية',
              'loc': 'غابة رغدان — الباحة',
            },
            {
              'name': 'منتزه الأمير حسام — الباحة',
              'type': 'أماكن سياحية',
              'loc': 'منتزه الأمير حسام — الباحة',
            },
            {
              'name': 'منتزه خيرة — الباحة',
              'type': 'أماكن سياحية',
              'loc': 'منتزه خيرة — الباحة',
            },
            {
              'name': 'منتزه الشكران — الباحة',
              'type': 'أماكن سياحية',
              'loc': 'منتزه الشكران — الباحة',
            },
            {
              'name': 'حديقة السلام — الباحة',
              'type': 'أماكن سياحية',
              'loc': 'حديقة السلام — الباحة',
            },
            {
              'name': 'حديقة المطار — الباحة',
              'type': 'أماكن سياحية',
              'loc': 'حديقة المطار — الباحة',
            },
            {
              'name': 'منتزه غابة شهبة — بلجرشي',
              'type': 'أماكن سياحية',
              'loc': 'منتزه غابة شهبة — بلجرشي',
            },
            {
              'name': 'حديقة بلجرشي العامة — بلجرشي',
              'type': 'أماكن سياحية',
              'loc': 'حديقة بلجرشي العامة — بلجرشي',
            },
            {
              'name': 'منتزه المندق — المندق',
              'type': 'أماكن سياحية',
              'loc': 'منتزه المندق — المندق',
            },
            {
              'name': 'حديقة القرى — القرى',
              'type': 'أماكن سياحية',
              'loc': 'حديقة القرى — القرى',
            },
          ],
        },
        {
          'name': ' الباحه',
          'places': [],
        },
        {
          'name': 'بالجرشي ',
          'places': [],
        },
        {
          'name': 'المخواه',
          'places': [],
        },
        {
          'name': 'قرية ذي عين',
          'places': [],
        },
      ],
    },
    {
      'name': 'جازان',
      'image': 'assets/images/jazan.jpg',
      'desc': 'ارض الفل والكادي وجزر فرسان',
      'provinces': [
        {'name': 'جازان', 'places': [


          ]
},
        {'name': 'صبيا', 'places': [


          ]
},
        {'name': 'ابو عريش', 'places': [


          ]
},
        {'name': 'صامطه', 'places': [


          ]
},
        {'name': 'فيفا', 'places': [


          ]
},
        {'name': 'فرسان', 'places': [


          ]
},
      ],
    },
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          'مرحباً ألف',
          style: TextStyle(
            color: Colors.white,
            fontSize: 20,
            fontWeight: FontWeight.w900,
            fontFamily: 'Tajawal',
          ),
        ), // <-- هذا القوس هو اللي كان ناقص ويقفل العنوان
        actions: [
          IconButton(
            icon: const Icon(Icons.map, color: Colors.white),
            onPressed: () {
              Navigator.push(
                context,
                MaterialPageRoute(builder: (context) => MapPage()),
              );
            },
          ),
          IconButton(
            icon: const Icon(Icons.chat_bubble_outline, color: Colors.white),
            onPressed: () {
              Navigator.push(
                context,
                MaterialPageRoute(builder: (context) => const ChatPage()),
              );
            },
          ),
          IconButton(
            icon: const Icon(
              Icons.account_circle,
              size: 32,
              color: Colors.white,
            ),
            onPressed: () {
              Navigator.push(
                context,
                MaterialPageRoute(builder: (context) => LoginPage()),
              );
            },
          ),
        ], // <-- هذا يقفل قائمة الأزرار
        centerTitle: true,
        backgroundColor: const Color.fromARGB(255, 19, 54, 21),
      ), // <-- وهذا القوس يقفل الـ AppBar بالكامل
      drawer: _buildDrawer(context),
      body: ListView.builder(
        padding: EdgeInsets.all(15),
        itemCount: regions.length,
        itemBuilder: (context, index) {
          return _buildCityCard(context, regions[index]);
        },
      ),
    );
  }
}

Widget _buildDrawer(BuildContext context) {
  return Drawer(
    child: Column(
      children: [
        UserAccountsDrawerHeader(
          decoration: BoxDecoration(
            color: const Color.fromARGB(255, 19, 54, 21),
            image: DecorationImage(
              image: const AssetImage('assets/images/sekt2.jpg'),
              fit: BoxFit.cover,
              colorFilter: ColorFilter.mode(
                const Color.fromARGB(255, 19, 54, 21).withOpacity(0.6),
                BlendMode.darken,
              ),
            ),
          ),
          accountName: Text("سكة الجنوب"),
          accountEmail: Text("وجهتك القادمة في قلب السحاب"),
          currentAccountPicture: CircleAvatar(
            backgroundColor: Colors.white,
            child: Icon(
              Icons.person,
              color: Color.fromARGB(255, 19, 54, 21),
              size: 40,
            ),
          ),
        ),
        Spacer(),
        ListTile(
          leading: Icon(Icons.logout),
          title: Text('تسجيل الخروج'),
          onTap: () {
            Navigator.pushAndRemoveUntil(
              context,
              MaterialPageRoute(builder: (context) => LoginPage()),
              (Route<dynamic> route) => false,
            );
          },
        ),
      ],
    ),
  );
}

Widget _buildCityCard(BuildContext context, Map<String, dynamic> city) {
  return InkWell(
    onTap: () {
      if (city.containsKey('provinces') && city['provinces'] != null) {
        Navigator.push(
          context,
          MaterialPageRoute(builder: (context) => ProvincePage(region: city)),
        );
      } else {
        Navigator.push(
          context,
          MaterialPageRoute(builder: (context) => CityDetailsPage(city: city)),
        );
      }
    },
    child: Container(
      height: 180,
      margin: const EdgeInsets.only(bottom: 15),
      decoration: BoxDecoration(
        borderRadius: BorderRadius.circular(20),
        image: DecorationImage(
          image: AssetImage(city['image'] ?? 'assets/images/placeholder.jpg'),
          fit: BoxFit.cover,
        ),
      ),
      child: Container(
        decoration: BoxDecoration(
          borderRadius: BorderRadius.circular(20),
          gradient: LinearGradient(
            begin: Alignment.bottomCenter,
            colors: [Colors.black.withOpacity(0.8), Colors.transparent],
          ),
        ),
        padding: const EdgeInsets.all(20),
        child: Column(
          mainAxisAlignment: MainAxisAlignment.end,
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              city['name'] ?? '',
              style: const TextStyle(
                color: Colors.white,
                fontSize: 24,
                fontWeight: FontWeight.bold,
              ),
            ),
            const SizedBox(height: 4),
            Text(
              city['desc'] ?? '',
              style: TextStyle(
                color: Colors.white.withOpacity(0.9),
                fontSize: 14,
              ),
            ),
          ],
        ),
      ),
    ),
  );
}

class CityDetailsPage extends StatelessWidget {
  final Map<String, dynamic> city;
  CityDetailsPage({required this.city});

  Future<void> _openGoogleMap(String query) async {
    final String encodedQuery = Uri.encodeComponent(query);
    final Uri url = Uri.parse(
      "https://www.google.com/maps/search/?api=1&query=$encodedQuery",
    );
    if (!await launchUrl(url, mode: LaunchMode.externalApplication)) {
      throw 'Could not launch $url';
    }
  }

  @override
  Widget build(BuildContext context) {
    return DefaultTabController(
      length: 4,
      child: Scaffold(
        appBar: AppBar(
          title: Text(
            city['name']!,
            style: const TextStyle(
              color: Colors.white,
              fontFamily: 'Tajawal',
              fontWeight: FontWeight.bold,
            ),
          ),
          centerTitle: true,
          backgroundColor: const Color.fromARGB(255, 19, 54, 21),
          iconTheme: const IconThemeData(color: Colors.white),
          bottom: TabBar(
            isScrollable: true,
            labelColor: Colors.amber,
            unselectedLabelColor: Colors.white,
            indicatorColor: Colors.amber,
            tabs: [
              Tab(text: '🏙 أماكن سياحية'),
              Tab(text: '🥘 مطاعم'),
              Tab(text: '☕️ مقاهي'),
              Tab(text: '🏛 معالم أثرية'),
            ],
          ),
        ),
        body: TabBarView(
          children: [
            _buildList(city['places'], 'أماكن سياحية'),
            _buildList(city['places'], 'مطاعم'),
            _buildList(city['places'], 'مقاهي'),
            _buildList(city['places'], 'معالم أثرية'),
          ],
        ),
      ),
    );
  }

  Widget _buildList(List<dynamic> places, String type) {
    final filtered = places.where((p) => p['type'] == type).toList();
    return ListView.builder(
      padding: const EdgeInsets.all(10),
      itemCount: filtered.length,
      itemBuilder: (context, index) {
        final place = filtered[index];
        return Card(
          margin: const EdgeInsets.only(bottom: 15),
          shape: RoundedRectangleBorder(
            borderRadius: BorderRadius.circular(15),
          ),
          elevation: 4,
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              // 1. عرض الصورة
              Padding(
                padding: const EdgeInsets.all(12),
                child: Column(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    // 2. الاسم واللوكيشن
                    Row(
                      mainAxisAlignment: MainAxisAlignment.spaceBetween,
                      children: [
                        Text(
                          place['name'],
                          style: const TextStyle(
                            fontSize: 18,
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                        IconButton(
                          icon: const Icon(
                            Icons.location_on,
                            color: Colors.red,
                          ),
                          onPressed: () => _openGoogleMap(place['loc']),
                        ),
                      ],
                    ),
                    // 3. نجوم التقييم (نفس تصميم البنات)
                    StatefulBuilder(
                      builder: (context, setState) {
                        return Row(
                          children: [
                            ...List.generate(5, (starIndex) {
                              return GestureDetector(
                                onTap: () {
                                  setState(() {
                                    // هنا نحدث التقييم في بيانات المكان فوراً
                                    place['rating'] = starIndex + 1;
                                  });
                                },
                                child: Icon(
                                  starIndex < (place['rating'] ?? 0)
                                      ? Icons.star
                                      : Icons.star_border,
                                  color: Colors.amber,
                                  size: 28, // حجم أكبر للراحة
                                ),
                              );
                            }),
                            const SizedBox(width: 8),
                            Text(
                              "${place['rating'] ?? 0}.0",
                              style: const TextStyle(
                                fontWeight: FontWeight.bold,
                              ),
                            ),
                          ],
                        );
                      },
                    ),
                    const SizedBox(height: 8),
                    // 4. الوصف
                    Text(
                      place['desc'] ?? '',
                      style: TextStyle(color: Colors.grey[700], fontSize: 14),
                    ),
                  ],
                ),
              ),
            ],
          ),
        );
      },
    );
  }
}

class LoginPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Container(
        decoration: BoxDecoration(
          gradient: LinearGradient(
            begin: Alignment.topLeft,
            end: Alignment.bottomRight,
            colors: [
              Color.fromARGB(255, 19, 54, 21),
              Color.fromARGB(255, 46, 125, 50),
            ],
          ),
        ),
        child: Center(
          child: SingleChildScrollView(
            child: Column(
              children: [
                Icon(Icons.landscape_rounded, size: 100, color: Colors.white),
                Text(
                  'سكة الجنوب',
                  style: TextStyle(
                    color: Colors.white,
                    fontSize: 32,
                    fontWeight: FontWeight.bold,
                    fontFamily: 'Tajawal',
                  ),
                ),
                SizedBox(height: 40),
                Container(
                  margin: EdgeInsets.symmetric(horizontal: 25),
                  padding: EdgeInsets.all(30),
                  decoration: BoxDecoration(
                    color: Colors.white.withOpacity(0.9),
                    borderRadius: BorderRadius.circular(30),
                  ),
                  child: Column(
                    children: [
                      // خانة البريد الإلكتروني
                      TextField(
                        decoration: InputDecoration(
                          prefixIcon: Icon(Icons.email_outlined),
                          hintText: 'البريد الإلكتروني',
                          border: OutlineInputBorder(
                            borderRadius: BorderRadius.circular(15),
                          ),
                        ),
                      ),
                      SizedBox(height: 20),

                      // خانة كلمة المرور
                      TextField(
                        obscureText: true,
                        decoration: InputDecoration(
                          prefixIcon: Icon(Icons.lock_outline),
                          hintText: 'كلمة المرور',
                          border: OutlineInputBorder(
                            borderRadius: BorderRadius.circular(15),
                          ),
                        ),
                      ),
                      SizedBox(height: 30),

                      // زر الدخول الاحترافي
                      ElevatedButton(
                        onPressed: () {
                          Navigator.pushReplacement(
                            context,
                            MaterialPageRoute(builder: (context) => HomePage()),
                          );
                        },
                        style: ElevatedButton.styleFrom(
                          backgroundColor: Colors.orange.shade700,
                          minimumSize: Size(double.infinity, 55),
                          shape: RoundedRectangleBorder(
                            borderRadius: BorderRadius.circular(15),
                          ),
                        ),
                        child: Text(
                          'دخول',
                          style: TextStyle(fontSize: 18, color: Colors.white),
                        ),
                      ),
                    ],
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}

class FavoritesPage extends StatelessWidget {
  final List<Map<String, dynamic>> favoritePlaces;

  FavoritesPage({required this.favoritePlaces});
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text(
          'المفضلة',
          style: TextStyle(
            color: Colors.white,
            fontFamily: 'Tajawal',
            fontWeight: FontWeight.bold,
          ),
        ),
        backgroundColor: const Color.fromARGB(255, 19, 54, 21),
        centerTitle: true,
        iconTheme: const IconThemeData(color: Colors.white),
      ),
      body: favoritePlaces.isEmpty
          ? const Center(
              child: Text(
                'لا توجد أماكن في المفضلة بعد',
                style: TextStyle(fontFamily: 'Tajawal', fontSize: 18),
              ),
            )
          : ListView.builder(
              itemCount: favoritePlaces.length,
              itemBuilder: (context, index) {
                final place = favoritePlaces[index];
                return ListTile(
                  leading: const Icon(
                    Icons.location_on,
                    color: Color.fromARGB(255, 19, 54, 21),
                  ),
                  title: Text(
                    place['name'] ?? 'مكان غير معروف',
                    style: const TextStyle(
                      fontFamily: 'Tajawal',
                      fontWeight: FontWeight.bold,
                    ),
                  ),
                );
              },
            ),
    );
  }
}

class MapPage extends StatefulWidget {
  const MapPage({super.key});

  @override
  State<MapPage> createState() => _MapPageState();
}

class _MapPageState extends State<MapPage> {
  bool isManualSelection = false; // هل المستخدم فعل وضع التحديد اليدوي؟
  LatLng? pickedLocation; // مكان الدبوس اللي بيختاره المستخدم
  GoogleMapController? _mapController;
  // دالة تفتح خرائط جوجل وتوجهك لمكان الدبوس
  Future<void> _launchMaps() async {
    if (pickedLocation != null) {
      final String url =
          "https://www.google.com/maps/dir/?api=1&destination=${pickedLocation!.latitude},${pickedLocation!.longitude}&travelmode=driving";
      final Uri uri = Uri.parse(url);
      if (await canLaunchUrl(uri)) {
        await launchUrl(uri, mode: LaunchMode.externalApplication);
      }
    }
  }

  // قائمة المواقع السياحية (الدبابيس)
  final Set<Marker> _southMarkers = {
    // --- معالم وأماكن سياحية (باللون الأخضر) ---
    Marker(
      markerId: const MarkerId('soudah'),
      position: const LatLng(18.2671, 42.3681),
      infoWindow: const InfoWindow(
        title: 'منتزه السودة',
        snippet: 'أعلى قمة في المملكة',
      ),
      icon: BitmapDescriptor.defaultMarkerWithHue(BitmapDescriptor.hueGreen),
    ),
    Marker(
      markerId: const MarkerId('almaz'),
      position: const LatLng(18.1945, 42.3353),
      infoWindow: const InfoWindow(
        title: 'رجال ألمع',
        snippet: 'قرية تراثية عالمية',
      ),
      icon: BitmapDescriptor.defaultMarkerWithHue(BitmapDescriptor.hueGreen),
    ),

    // --- مطاعم (باللون الأحمر) ---
    Marker(
      markerId: const MarkerId('res_abha'),
      position: const LatLng(18.2331, 42.5112),
      infoWindow: const InfoWindow(
        title: 'مطعم حنيذ الجنوب',
        snippet: 'أكلات شعبية أصيلة',
      ),
      icon: BitmapDescriptor.defaultMarkerWithHue(BitmapDescriptor.hueRed),
    ),
    Marker(
      markerId: const MarkerId('res_taste'),
      position: const LatLng(18.2250, 42.5100),
      infoWindow: const InfoWindow(
        title: 'مطعم مذاق الجنوب',
        snippet: 'ألذ الأطباق الجنوبية',
      ),
      icon: BitmapDescriptor.defaultMarkerWithHue(BitmapDescriptor.hueRed),
    ),

    // --- مقاهي (باللون الأزرق) ---
    Marker(
      markerId: const MarkerId('cafe_cloud'),
      position: const LatLng(18.2132, 42.5050),
      infoWindow: const InfoWindow(
        title: 'مقهى السحاب',
        snippet: 'إطلالة خيالية على مدينة أبها',
      ),
      icon: BitmapDescriptor.defaultMarkerWithHue(BitmapDescriptor.hueAzure),
    ),
    Marker(
      markerId: const MarkerId('cafe_sky'),
      position: const LatLng(18.2410, 42.5220),
      infoWindow: const InfoWindow(
        title: 'مقهى ومحمصة سكاى',
        snippet: 'قهوة مختصة وجلسات رائعة',
      ),
      icon: BitmapDescriptor.defaultMarkerWithHue(BitmapDescriptor.hueAzure),
    ),
  };

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('خريطة سكة الجنوب السياحية'),
        backgroundColor: const Color.fromARGB(255, 19, 54, 21),
      ),
      body: GoogleMap(
        onMapCreated: (controller) {
          _mapController = controller;
          // هذا الكود يخلي الخريطة تروح لموقعك فوراً
          Geolocator.getCurrentPosition().then((pos) {
            _mapController?.animateCamera(
              CameraUpdate.newLatLng(LatLng(pos.latitude, pos.longitude)),
            );
          });
        },
        initialCameraPosition: const CameraPosition(
          target: LatLng(18.2166, 42.5000), // تبدأ الخريطة من أبها
          zoom: 10.0,
        ),
        myLocationEnabled: true, // يظهر الدائرة الزرقاء لموقعك
        myLocationButtonEnabled: true,
        onTap: (position) {
          if (isManualSelection) {
            setState(() {
              pickedLocation = position;
            });
          }
        }, // يظهر زر العودة لموقعك
        markers: {
          ..._southMarkers,
          if (pickedLocation != null)
            Marker(
              markerId: const MarkerId('manual_pin'),
              position: pickedLocation!,
              icon: BitmapDescriptor.defaultMarkerWithHue(
                  BitmapDescriptor.hueAzure),
              infoWindow: InfoWindow(
                title: 'موقعي المختار',
                snippet: 'اضغط هنا للذهاب للموقع عبر Google Maps',
                onTap: () {
                  _launchMaps(); // <--- هذا السطر ينادي الدالة اللي تفتح الخريطة
                },
              ),
            ),
        },
      ),
      floatingActionButton: FloatingActionButton.extended(
        onPressed: () {
          setState(() {
            isManualSelection = !isManualSelection;
            if (!isManualSelection) pickedLocation = null;
          });
        },
        label: Text(isManualSelection ? 'إلغاء التحديد' : 'تحديد يدوي'),
        icon: Icon(isManualSelection ? Icons.close : Icons.pin_drop),
        backgroundColor: isManualSelection ? Colors.red : Colors.green,
      ),
    );
  }
}

class ProvincePage extends StatelessWidget {
  final Map<String, dynamic> region;
  const ProvincePage({super.key, required this.region});

  @override
  Widget build(BuildContext context) {
    var provinces = region['provinces'] as List;
    return Scaffold(
      backgroundColor: const Color(0xFFF5F5F7), // خلفية رمادية فاتحة جداً
      appBar: AppBar(
        title: Text(
          region['name'],
          style: const TextStyle(
            fontWeight: FontWeight.bold,
            color: Colors.black87,
          ),
        ),
        centerTitle: true,
        backgroundColor: Colors.white,
        elevation: 0, // فلات وبدون ظل
        iconTheme: const IconThemeData(color: Colors.black87),
      ),
      body: ListView.builder(
        itemCount: provinces.length,
        padding: const EdgeInsets.symmetric(vertical: 10),
        itemBuilder: (context, index) {
          return Padding(
            padding: const EdgeInsets.symmetric(horizontal: 16, vertical: 6),
            child: InkWell(
              onTap: () {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                    builder: (context) =>
                        CityDetailsPage(city: provinces[index]),
                  ),
                );
              },
              child: Container(
                padding: const EdgeInsets.all(18),
                decoration: BoxDecoration(
                  color: Colors.white,
                  borderRadius: BorderRadius.circular(15),
                  boxShadow: [
                    BoxShadow(
                      color: Colors.black.withOpacity(0.04),
                      blurRadius: 10,
                      offset: const Offset(0, 4),
                    ),
                  ],
                ),
                child: Row(
                  children: [
                    const Icon(
                      Icons.explore_outlined,
                      color: Colors.black38,
                    ), // أيقونة بسيطة
                    const SizedBox(width: 15),
                    Expanded(
                      child: Text(
                        provinces[index]['name'],
                        style: const TextStyle(
                          fontSize: 18,
                          fontWeight: FontWeight.w600,
                          color: Colors.black87,
                        ),
                      ),
                    ),
                    const Icon(
                      Icons.arrow_forward_ios,
                      size: 14,
                      color: Colors.black26,
                    ),
                  ],
                ),
              ),
            ),
          );
        },
      ),
    );
  }
}
